liujkek22/CTcloud-309/Liliuyu FTP_LI/STM32 Project/STM32F103C8T6/进阶项目/基于STM32F103C8T6 简易示波器/源码/Hardware/DMA.c
#include "stm32f10x.h"                  // Device header

u32 MyDMA_Size;//保存DMA每次数据传送的长度

void MYDMA_Config(DMA_Channel_TypeDef* DMA_CHx,u32 AddrA,u32 AddrB,u16 cndtr)    //(DMA通道CHx,外设地址，存储地址，数据传输量)
{
 	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);	                         //使能DMA时钟	
    DMA_DeInit(DMA_CHx);   														 //将DMA的通道1寄存器重设为缺省值
	MyDMA_Size=cndtr;
    DMA_InitTypeDef DMA_InitStructure;
	DMA_InitStructure.DMA_PeripheralBaseAddr = AddrA;                            //DMA外设基地址
	DMA_InitStructure.DMA_MemoryBaseAddr = AddrB;                                //DMA内存基地址
	DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;                           //数据传输方向，从内存读取发送到外设
	DMA_InitStructure.DMA_BufferSize = cndtr;                                    //DMA通道的DMA缓存的大小
	DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;             //外设地址寄存器不变
	DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;                      //内存地址寄存器递增
	DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;      //数据宽度为8位
	DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;              //数据宽度为8位
	DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;                                //工作在   DMA_Mode_Circular循环模式
	DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;                        //DMA通道 x拥有中优先级 
	DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;                                 //DMA通道x没有设置为内存到内存传输
	DMA_Init(DMA_CHx, &DMA_InitStructure);                                       //根据DMA_InitStruct中指定的参数初始化DMA的通道USART1_Tx_DMA_Channel所标识的寄存器

}


void DMA_Transfer(DMA_Channel_TypeDef*DMA_CHx)
{ 
	DMA_Cmd(DMA_CHx, DISABLE );                                                  //失能DMA1通道X      
 	DMA_SetCurrDataCounter(DMA_CHx,MyDMA_Size);                                  //重置转运计数器
 	DMA_Cmd(DMA_CHx, ENABLE);                                                    //使能DMA1通道X  
}	
